#pragma once
#include <cmath>
#include <Windows.h>
#include "cglobalvars.h"
#include "../sdk/cnetvars/cnetvars.h"
#include "../sdk/convar/convar.h"
#include "../tools/vmt/getvfunc.h"
#include "../tools/vmt/vmthooks.h"
#include "headers/vector.h"
#include "headers/color.h"
#include "headers/dt_recv2.h"
#include "headers/studio.h"
#include "headers/weaponlist.h"
#include "headers/bspflags.h"
using namespace std;

#define WIN32_LEAN_AND_MEAN
#pragma warning(disable:4996)
#pragma warning(disable:4244)

using CreateInterfaceFn = void *( * )( const char *pName, int *pReturnCode );

class CGameTrace;
class CUtil;
class CNetVars;
class CBaseCombatWeapon;
class matrix3x4_t;
class IMaterialVar;
class IMesh;
class IVertexBuffer;
class IIndexBuffer;
struct MaterialSystem_Config_t;
class VMatrix;
class matrix3x4_t;
class ITexture;
struct MaterialSystemHWID_t;
class IShader;
class IVertexTexture;
class IMorph;
class IMatRenderContext;
class ICallQueue;
struct MorphWeight_t;
class IFileList;
struct VertexStreamSpec_t;
struct ShaderStencilState_t;
struct MeshInstanceData_t;
class IClientMaterialSystem;
class CPaintMaterial;
class IPaintMapDataManager;
class IPaintMapTextureManager;
class GPUMemoryStats;
struct AspectRatioInfo_t;
struct CascadedShadowMappingState_t;
struct model_t;
struct VisibleFogVolumeInfo_t;
struct VisOverrideData_t;
struct WorldListInfo_t;
class IWorldRenderList;
class IBrushRenderer;
class IClientRenderable;
class IHandleEntity;
class bf_write;
class IMaterialProxyFactory;
class ITexture;
class IMaterialSystemHardwareConfig;
class CShadowMgr;
class IMaterial;
class KeyValues;
class InputEvent_t;
class INetMessage;
class INetChannelHandler;

using VertexFormat_t = unsigned __int64;
using trace_t = class CGameTrace;
using matrix3x4 = float[3][4];
using ModelInstanceHandle_t = int;
using FileHandle_t = void*;
using MaterialHandle_t = unsigned short;

#define me gInts.Engine->GetLocalPlayer()
#define GetBaseEntity gInts.EntList->GetClientEntity
#define GetBaseEntityFromHandle gInts.EntList->GetClientEntityFromHandle
#define FL_ONGROUND 1
#define FLOW_OUTGOING 0
#define FLOW_INCOMING 1


inline wstring ToWstring( const char *text ) {
  size_t length = strlen( text ) + 1;
  wstring wc( length, L'#' );
  mbstowcs( &wc[0], text, length );
  return wc;
}

#define XASSERT( x ) if( !(x) ) Fatal( #x );

inline void Fatal( const char *fault ) {
  MessageBoxA( nullptr, fault, "FATAL ERROR", MB_ICONERROR | MB_TOPMOST );
  ExitProcess( 0 );
}

typedef struct player_info_s {
  char name[32];
  int userID;
  char guid[33];
  unsigned long friendsID;
  char friendsName[32];
  bool fakeplayer;
  bool ishltv;
  unsigned long customFiles[4];
  unsigned char filesDownloaded;
} player_info_t;

enum MoveType_t {
  MOVETYPE_NONE = 0, 
  /**< never moves */
  MOVETYPE_ISOMETRIC, 
  /**< For players */
  MOVETYPE_WALK, 
  /**< Player only - moving on the ground */
  MOVETYPE_STEP, 
  /**< gravity, special edge handling -- monsters use this */
  MOVETYPE_FLY, 
  /**< No gravity, but still collides with stuff */
  MOVETYPE_FLYGRAVITY, 
  /**< flies through the air + is affected by gravity */
  MOVETYPE_VPHYSICS, 
  /**< uses VPHYSICS for simulation */
  MOVETYPE_PUSH, 
  /**< no clip to world, push and crush */
  MOVETYPE_NOCLIP, 
  /**< No gravity, no collisions, still do velocity/avelocity
       */
  MOVETYPE_LADDER, 
  /**< Used by players only when going onto a ladder */
  MOVETYPE_OBSERVER, 
  /**< Observer movement, depends on player's observer mode*/
  MOVETYPE_CUSTOM, 
  /**< Allows the entity to describe its own physics */
  
  MOVETYPE_LAST = MOVETYPE_CUSTOM, 
  
  MOVETYPE_MAX_BITS = 4, 
};

class ClientClass {
 private:
  BYTE padding[8];
  
 public:
  const char *name;
  RecvTable *table;
  ClientClass *next;
  int classId;
};

class CHLClient {
 public:
  ClientClass *GetAllClasses() {
    using OriginalFn = ClientClass * ( __thiscall * )( PVOID );
    return getvfunc<OriginalFn>( this, 8 )( this );
  }
};

class CGlobals {
 public:
  float realtime;
  int framecount;
  float absoluteframetime;
  float curtime;
  float frametime;
  int maxclients;
  int tickcount;
  float interval_per_tick;
  float interpolation_amount;
  int Shots;
};

class CUserCmd {
 public:
  virtual ~CUserCmd() {}; // Destructor 0
  int command_number; // 4
  int tick_count; // 8
  Vector viewangles; // C
  float forwardmove; // 18
  float sidemove; // 1C
  float upmove; // 20
  int buttons; // 24
  byte impulse; // 28
  int weaponselect; // 2C
  int weaponsubtype; // 30
  int random_seed; // 34
  short mousedx; // 38
  short mousedy; // 3A
  bool hasbeenpredicted; // 3C;
};

enum ClientFrameStage_t {
  FRAME_UNDEFINED = -1, 
  // haven't run any frames yet
  FRAME_START, 
  // A network packet is being recieved
  FRAME_NET_UPDATE_START, 
  // Data has been received and we're going to start calling PostDataUpdate
  FRAME_NET_UPDATE_POSTDATAUPDATE_START, 
  // Data has been received and we've called PostDataUpdate on all data
  // recipients
  FRAME_NET_UPDATE_POSTDATAUPDATE_END, 
  // We've received all packets, we can now do interpolation, prediction, etc..
  FRAME_NET_UPDATE_END, 
  // We're about to start rendering the scene
  FRAME_RENDER_START, 
  // We've finished rendering the scene.
  FRAME_RENDER_END
};

enum tf_classes {
  TF2_Scout = 1, 
  TF2_Soldier = 3, 
  TF2_Pyro = 7, 
  TF2_Demoman = 4, 
  TF2_Heavy = 6, 
  TF2_Engineer = 9, 
  TF2_Medic = 5, 
  TF2_Sniper = 2, 
  TF2_Spy = 8, 
};

class CBaseEntity {
 public:
  template <typename T>
  T get( uint32_t off ) {
